zhtlab/KICADKEY/subcpu/Devices/STM32H7/include/stm32h7Rcc.h
/*
 * Copyright (c) 2018 zhtlab
 *
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files
 * (the "Software"), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to permit
 * persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 */

#ifndef _STM32H7RCC_H_
#define _STM32H7RCC_H_

typedef struct {
/*** 0x000  RCC CR */
  __IO uint32_t         CR;
#define RCC_CR_PLL3RDY_SHIFT    (29)
#define RCC_CR_PLL3RDY_MASK     (1 << (RCC_CR_PLL3RDY_SHIFT))
#define RCC_CR_PLL3RDY_NO       (0 << (RCC_CR_PLL3RDY_SHIFT))
#define RCC_CR_PLL3RDY_YES      (1 << (RCC_CR_PLL3RDY_SHIFT))
#define RCC_CR_PLL3ON_SHIFT     (28)
#define RCC_CR_PLL3ON_MASK      (1 << (RCC_CR_PLL3ON_SHIFT))
#define RCC_CR_PLL3ON_NO        (0 << (RCC_CR_PLL3ON_SHIFT))
#define RCC_CR_PLL3ON_YES       (1 << (RCC_CR_PLL3ON_SHIFT))
#define RCC_CR_PLL2RDY_SHIFT    (27)
#define RCC_CR_PLL2RDY_MASK     (1 << (RCC_CR_PLL2RDY_SHIFT))
#define RCC_CR_PLL2RDY_NO       (0 << (RCC_CR_PLL2RDY_SHIFT))
#define RCC_CR_PLL2RDY_YES      (1 << (RCC_CR_PLL2RDY_SHIFT))
#define RCC_CR_PLL2ON_SHIFT     (26)
#define RCC_CR_PLL2ON_MASK      (1 << (RCC_CR_PLL2ON_SHIFT))
#define RCC_CR_PLL2ON_NO        (0 << (RCC_CR_PLL2ON_SHIFT))
#define RCC_CR_PLL2ON_YES       (1 << (RCC_CR_PLL2ON_SHIFT))
#define RCC_CR_PLL1RDY_SHIFT    (25)
#define RCC_CR_PLL1RDY_MASK     (1 << (RCC_CR_PLL1RDY_SHIFT))
#define RCC_CR_PLL1RDY_NO       (0 << (RCC_CR_PLL1RDY_SHIFT))
#define RCC_CR_PLL1RDY_YES      (1 << (RCC_CR_PLL1RDY_SHIFT))
#define RCC_CR_PLL1ON_SHIFT     (24)
#define RCC_CR_PLL1ON_MASK      (1 << (RCC_CR_PLL1ON_SHIFT))
#define RCC_CR_PLL1ON_NO        (0 << (RCC_CR_PLL1ON_SHIFT))
#define RCC_CR_PLL1ON_YES       (1 << (RCC_CR_PLL1ON_SHIFT))

#define RCC_CR_HSECSSON_SHIFT   (19)
#define RCC_CR_HSECSSON_MASK    (1 << (RCC_CR_HSECSSON_SHIFT))
#define RCC_CR_HSECSSON_NO      (0 << (RCC_CR_HSECSSON_SHIFT))
#define RCC_CR_HSECSSON_YES     (1 << (RCC_CR_HSECSSON_SHIFT))
#define RCC_CR_HSEBYP_SHIFT     (18)
#define RCC_CR_HSEBYP_MASK      (1 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSEBYP_NO        (0 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSEBYP_YES       (1 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSERDY_SHIFT     (17)
#define RCC_CR_HSERDY_MASK      (1 << (RCC_CR_HSERDY_SHIFT))
#define RCC_CR_HSERDY_NO        (0 << (RCC_CR_HSERDY_SHIFT))
#define RCC_CR_HSERDY_YES       (1 << (RCC_CR_HSERDY_SHIFT))
#define RCC_CR_HSEON_SHIFT      (16)
#define RCC_CR_HSEON_MASK       (1 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_HSEON_NO         (0 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_HSEON_YES        (1 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_HSI48RDY_SHIFT   (13)
#define RCC_CR_HSI48RDY_MASK    (1 << (RCC_CR_HSI48RDY_SHIFT))
#define RCC_CR_HSI48RDY_NO      (0 << (RCC_CR_HSI48RDY_SHIFT))
#define RCC_CR_HSI48RDY_YES     (1 << (RCC_CR_HSI48RDY_SHIFT))
#define RCC_CR_HSI48ON_SHIFT    (12)
#define RCC_CR_HSI48ON_MASK     (1 << (RCC_CR_HSI48ON_SHIFT))
#define RCC_CR_HSI48ON_NO       (0 << (RCC_CR_HSI48ON_SHIFT))
#define RCC_CR_HSI48ON_YES      (1 << (RCC_CR_HSI48ON_SHIFT))
#define RCC_CR_CSIKERON_SHIFT   (9)
#define RCC_CR_CSIKERON_MASK    (1 << (RCC_CR_CSIKERON_SHIFT))
#define RCC_CR_CSIKERON_NO      (0 << (RCC_CR_CSIKERON_SHIFT))
#define RCC_CR_CSIKERON_YES     (1 << (RCC_CR_CSIKERON_SHIFT))
#define RCC_CR_CSIRDY_SHIFT     (8)
#define RCC_CR_CSIRDY_MASK      (1 << (RCC_CR_CSIRDY_SHIFT))
#define RCC_CR_CSIRDY_NO        (0 << (RCC_CR_CSIRDY_SHIFT))
#define RCC_CR_CSIRDY_YES       (1 << (RCC_CR_CSIRDY_SHIFT))
#define RCC_CR_CSION_SHIFT      (7)
#define RCC_CR_CSION_MASK       (1 << (RCC_CR_CSION_SHIFT))
#define RCC_CR_CSION_NO         (0 << (RCC_CR_CSION_SHIFT))
#define RCC_CR_CSION_YES        (1 << (RCC_CR_CSION_SHIFT))
#define RCC_CR_HSIDIVF_SHIFT    (5)
#define RCC_CR_HSIDIVF_MASK     (1 << (RCC_CR_HSIDIVF_SHIFT))
#define RCC_CR_HSIDIVF_NO       (0 << (RCC_CR_HSIDIVF_SHIFT))
#define RCC_CR_HSIDIVF_YES      (1 << (RCC_CR_HSIDIVF_SHIFT))
#define RCC_CR_HSIDIV_SHIFT     (3)
#define RCC_CR_HSIDIV_MASK      (3 << (RCC_CR_HSIDIV_SHIFT))
#define RCC_CR_HSIDIV_DIV1      (0 << (RCC_CR_HSIDIV_SHIFT))
#define RCC_CR_HSIDIV_DIV2      (1 << (RCC_CR_HSIDIV_SHIFT))
#define RCC_CR_HSIDIV_DIV4      (2 << (RCC_CR_HSIDIV_SHIFT))
#define RCC_CR_HSIDIV_DIV8      (3 << (RCC_CR_HSIDIV_SHIFT))
#define RCC_CR_HSIRDY_SHIFT     (2)
#define RCC_CR_HSIRDY_MASK      (1 << (RCC_CR_HSIRDY_SHIFT))
#define RCC_CR_HSIRDY_NO        (0 << (RCC_CR_HSIRDY_SHIFT))
#define RCC_CR_HSIRDY_YES       (1 << (RCC_CR_HSIRDY_SHIFT))
#define RCC_CR_HSIKERON_SHIFT   (1)
#define RCC_CR_HSIKERON_MASK    (1 << (RCC_CR_HSIKERON_SHIFT))
#define RCC_CR_HSIKERON_NO      (0 << (RCC_CR_HSIKERON_SHIFT))
#define RCC_CR_HSIKERON_YES     (1 << (RCC_CR_HSIKERON_SHIFT))
#define RCC_CR_HSION_SHIFT      (0)
#define RCC_CR_HSION_MASK       (1 << (RCC_CR_HSION_SHIFT))
#define RCC_CR_HSION_NO         (0 << (RCC_CR_HSION_SHIFT))
#define RCC_CR_HSION_YES        (1 << (RCC_CR_HSION_SHIFT))

  __IO uint32_t         ICSCR;
  __IO uint32_t         CRRCR;
  uint32_t              reserved0c;
/*** 0x010  RCC CFGR */
  __IO uint32_t         CFGR;
#define RCC_CFGR_MCO2_SHIFT         (29)
#define RCC_CFGR_MCO2_MASK          (7 << (RCC_CFGR_MCO2_SHIFT))
#define RCC_CFGR_MCO2_SYSTEM        (0 << (RCC_CFGR_MCO2_SHIFT))
#define RCC_CFGR_MCO2_PLL2          (1 << (RCC_CFGR_MCO2_SHIFT))        /* PLL2P */
#define RCC_CFGR_MCO2_HSE           (2 << (RCC_CFGR_MCO2_SHIFT))
#define RCC_CFGR_MCO2_PLL1          (3 << (RCC_CFGR_MCO2_SHIFT))        /* PLL1P */
#define RCC_CFGR_MCO2_CSI           (4 << (RCC_CFGR_MCO2_SHIFT))
#define RCC_CFGR_MCO2_LSI           (5 << (RCC_CFGR_MCO2_SHIFT))

#define RCC_CFGR_MCO2PRE_SHIFT      (25)
#define RCC_CFGR_MCO2PRE_MASK       (15  << (RCC_CFGR_MCO2PRE_SHIFT))
#define RCC_CFGR_MCO2PRE_DIS        (0   << (RCC_CFGR_MCO2PRE_SHIFT))
#define RCC_CFGR_MCO2PRE_DIV(x)     ((x) << (RCC_CFGR_MCO2PRE_SHIFT))
#define RCC_CFGR_MCO2PRE_DIV1       (1   << (RCC_CFGR_MCO2PRE_SHIFT))
#define RCC_CFGR_MCO2PRE_DIV2       (2   << (RCC_CFGR_MCO2PRE_SHIFT))
#define RCC_CFGR_MCO2PRE_DIV15      (15  << (RCC_CFGR_MCO2PRE_SHIFT))

#define RCC_CFGR_MCO1_SHIFT         (22)
#define RCC_CFGR_MCO1_MASK          (7 << (RCC_CFGR_MCO1_SHIFT))
#define RCC_CFGR_MCO1_HSI           (0 << (RCC_CFGR_MCO1_SHIFT))
#define RCC_CFGR_MCO1_LSE           (1 << (RCC_CFGR_MCO1_SHIFT))
#define RCC_CFGR_MCO1_HSE           (2 << (RCC_CFGR_MCO1_SHIFT))
#define RCC_CFGR_MCO1_PLL1          (3 << (RCC_CFGR_MCO1_SHIFT))        /* PLL1Q */
#define RCC_CFGR_MCO1_HSI48         (4 << (RCC_CFGR_MCO1_SHIFT))

