zhtlab/KICADKEY/subcpu/Devices/STM32H7/include/stm32h7Rcc.h
#define RCC_CFGR_MCO1PRE_SHIFT      (18)
#define RCC_CFGR_MCO1PRE_MASK       (15  << (RCC_CFGR_MCO1PRE_SHIFT))
#define RCC_CFGR_MCO1PRE_DIS        (0   << (RCC_CFGR_MCO1PRE_SHIFT))
#define RCC_CFGR_MCO1PRE_DIV(x)     ((x) << (RCC_CFGR_MCO1PRE_SHIFT))
#define RCC_CFGR_MCO1PRE_DIV1       (1   << (RCC_CFGR_MCO1PRE_SHIFT))
#define RCC_CFGR_MCO1PRE_DIV2       (2   << (RCC_CFGR_MCO1PRE_SHIFT))
#define RCC_CFGR_MCO1PRE_DIV15      (15  << (RCC_CFGR_MCO1PRE_SHIFT))

#define RCC_CFGR_SWS_SHIFT          (3)
#define RCC_CFGR_SWS_MASK           (3  << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_HSI            (0  << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_CSI            (1  << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_HSE            (2  << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_PLL1           (3  << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SW_SHIFT           (0)
#define RCC_CFGR_SW_MASK            (3  << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_HSI             (0  << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_CSI             (1  << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_HSE             (2  << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_PLL1            (3  << (RCC_CFGR_SW_SHIFT))

  uint32_t         reserved14;

  /*** 0x018  RCC D1CFGR */
  __IO uint32_t         D1CFGR;
#define RCC_D1CFGR_D1CPRE_SHIFT     (8)
#define RCC_D1CFGR_D1CPRE_MASK      (15 << (RCC_D1CFGR_D1CPRE_SHIFT))
#define RCC_D1CFGR_D1CPRE_DIV1      (0  << (RCC_D1CFGR_D1CPRE_SHIFT))
#define RCC_D1CFGR_D1CPRE_DIV2      (8  << (RCC_D1CFGR_D1CPRE_SHIFT))
#define RCC_D1CFGR_D1CPRE_DIV4      (9  << (RCC_D1CFGR_D1CPRE_SHIFT))
#define RCC_D1CFGR_D1CPRE_DIV8      (10 << (RCC_D1CFGR_D1CPRE_SHIFT))
#define RCC_D1CFGR_D1CPRE_DIV16     (11 << (RCC_D1CFGR_D1CPRE_SHIFT))
#define RCC_D1CFGR_D1CPRE_DIV64     (12 << (RCC_D1CFGR_D1CPRE_SHIFT))
#define RCC_D1CFGR_D1CPRE_DIV128    (13 << (RCC_D1CFGR_D1CPRE_SHIFT))
#define RCC_D1CFGR_D1CPRE_DIV256    (14 << (RCC_D1CFGR_D1CPRE_SHIFT))
#define RCC_D1CFGR_D1CPRE_DIV512    (15 << (RCC_D1CFGR_D1CPRE_SHIFT))
#define RCC_D1CFGR_D1PPRE_SHIFT     (4)
#define RCC_D1CFGR_D1PPRE_MASK      (7 << (RCC_D1CFGR_D1PPRE_SHIFT))
#define RCC_D1CFGR_D1PPRE_DIV1      (0 << (RCC_D1CFGR_D1PPRE_SHIFT))
#define RCC_D1CFGR_D1PPRE_DIV2      (4 << (RCC_D1CFGR_D1PPRE_SHIFT))
#define RCC_D1CFGR_D1PPRE_DIV4      (5 << (RCC_D1CFGR_D1PPRE_SHIFT))
#define RCC_D1CFGR_D1PPRE_DIV8      (6 << (RCC_D1CFGR_D1PPRE_SHIFT))
#define RCC_D1CFGR_D1PPRE_DIV16     (7 << (RCC_D1CFGR_D1PPRE_SHIFT))
#define RCC_D1CFGR_HPRE_SHIFT       (0)
#define RCC_D1CFGR_HPRE_MASK        (15 << (RCC_D1CFGR_HPRE_SHIFT))
#define RCC_D1CFGR_HPRE_DIV1        (0  << (RCC_D1CFGR_HPRE_SHIFT))
#define RCC_D1CFGR_HPRE_DIV2        (8  << (RCC_D1CFGR_HPRE_SHIFT))
#define RCC_D1CFGR_HPRE_DIV4        (9  << (RCC_D1CFGR_HPRE_SHIFT))
#define RCC_D1CFGR_HPRE_DIV8        (10 << (RCC_D1CFGR_HPRE_SHIFT))
#define RCC_D1CFGR_HPRE_DIV16       (11 << (RCC_D1CFGR_HPRE_SHIFT))
#define RCC_D1CFGR_HPRE_DIV64       (12 << (RCC_D1CFGR_HPRE_SHIFT))
#define RCC_D1CFGR_HPRE_DIV128      (13 << (RCC_D1CFGR_HPRE_SHIFT))
#define RCC_D1CFGR_HPRE_DIV256      (14 << (RCC_D1CFGR_HPRE_SHIFT))
#define RCC_D1CFGR_HPRE_DIV512      (15 << (RCC_D1CFGR_HPRE_SHIFT))

/*** 0x01c  RCC D2CFGR */
  __IO uint32_t         D2CFGR;
#define RCC_D2CFGR_D2PPRE2_SHIFT    (8)
#define RCC_D2CFGR_D2PPRE2_MASK     (7 << (RCC_D2CFGR_D2PPRE2_SHIFT))
#define RCC_D2CFGR_D2PPRE2_DIV1     (0 << (RCC_D2CFGR_D2PPRE2_SHIFT))
#define RCC_D2CFGR_D2PPRE2_DIV2     (4 << (RCC_D2CFGR_D2PPRE2_SHIFT))
#define RCC_D2CFGR_D2PPRE2_DIV4     (5 << (RCC_D2CFGR_D2PPRE2_SHIFT))
#define RCC_D2CFGR_D2PPRE2_DIV8     (6 << (RCC_D2CFGR_D2PPRE2_SHIFT))
#define RCC_D2CFGR_D2PPRE2_DIV16    (7 << (RCC_D2CFGR_D2PPRE2_SHIFT))
#define RCC_D2CFGR_D2PPRE1_SHIFT    (4)
#define RCC_D2CFGR_D2PPRE1_MASK     (7 << (RCC_D2CFGR_D2PPRE1_SHIFT))
#define RCC_D2CFGR_D2PPRE1_DIV1     (0 << (RCC_D2CFGR_D2PPRE1_SHIFT))
#define RCC_D2CFGR_D2PPRE1_DIV2     (4 << (RCC_D2CFGR_D2PPRE1_SHIFT))
#define RCC_D2CFGR_D2PPRE1_DIV4     (5 << (RCC_D2CFGR_D2PPRE1_SHIFT))
#define RCC_D2CFGR_D2PPRE1_DIV8     (6 << (RCC_D2CFGR_D2PPRE1_SHIFT))
#define RCC_D2CFGR_D2PPRE1_DIV16    (7 << (RCC_D2CFGR_D2PPRE1_SHIFT))

/*** 0x020  RCC D3CFGR */
  __IO uint32_t         D3CFGR;
#define RCC_D3CFGR_D3PPRE_SHIFT     (4)
#define RCC_D3CFGR_D3PPRE_MASK      (7 << (RCC_D3CFGR_D3PPRE_SHIFT))
#define RCC_D3CFGR_D3PPRE_DIV1      (0 << (RCC_D3CFGR_D3PPRE_SHIFT))
#define RCC_D3CFGR_D3PPRE_DIV2      (4 << (RCC_D3CFGR_D3PPRE_SHIFT))
#define RCC_D3CFGR_D3PPRE_DIV4      (5 << (RCC_D3CFGR_D3PPRE_SHIFT))
#define RCC_D3CFGR_D3PPRE_DIV8      (6 << (RCC_D3CFGR_D3PPRE_SHIFT))
#define RCC_D3CFGR_D3PPRE_DIV16     (7 << (RCC_D3CFGR_D3PPRE_SHIFT))

  uint32_t              reserved24;
/*** 0x028  RCC PLLCKSELR */
  __IO uint32_t         PLLCKSELR;
/* x can be set the specified value */
#define RCC_PLLCKSELR_DIVM3_SHIFT   (20)
#define RCC_PLLCKSELR_DIVM3_MASK    (0x3f << (RCC_PLLCKSELR_DIVM3_SHIFT))
#define RCC_PLLCKSELR_DIVM3_DIS     (0    << (RCC_PLLCKSELR_DIVM3_SHIFT))
#define RCC_PLLCKSELR_DIVM3(x)      ((x)  << (RCC_PLLCKSELR_DIVM3_SHIFT))
#define RCC_PLLCKSELR_DIVM2_SHIFT   (12)
#define RCC_PLLCKSELR_DIVM2_MASK    (0x3f << (RCC_PLLCKSELR_DIVM2_SHIFT))
#define RCC_PLLCKSELR_DIVM2_DIS     (0    << (RCC_PLLCKSELR_DIVM2_SHIFT))
#define RCC_PLLCKSELR_DIVM2(x)      ((x)  << (RCC_PLLCKSELR_DIVM2_SHIFT))
#define RCC_PLLCKSELR_DIVM1_SHIFT   (4)
#define RCC_PLLCKSELR_DIVM1_MASK    (0x3f << (RCC_PLLCKSELR_DIVM1_SHIFT))
#define RCC_PLLCKSELR_DIVM1_DIS     (0    << (RCC_PLLCKSELR_DIVM1_SHIFT))
#define RCC_PLLCKSELR_DIVM1(x)      ((x)  << (RCC_PLLCKSELR_DIVM1_SHIFT))
#define RCC_PLLCKSELR_PLLSRC_SHIFT  (0)
#define RCC_PLLCKSELR_PLLSRC_MASK   (0x3  << (RCC_PLLCKSELR_PLLSRC_SHIFT))
#define RCC_PLLCKSELR_PLLSRC_HSI    (0    << (RCC_PLLCKSELR_PLLSRC_SHIFT))
#define RCC_PLLCKSELR_PLLSRC_CSI    (1    << (RCC_PLLCKSELR_PLLSRC_SHIFT))
#define RCC_PLLCKSELR_PLLSRC_HSE    (2    << (RCC_PLLCKSELR_PLLSRC_SHIFT))
#define RCC_PLLCKSELR_PLLSRC_XXX    (3    << (RCC_PLLCKSELR_PLLSRC_SHIFT))

/*** 0x02c  RCC PLLCFGR */
  __IO uint32_t         PLLCFGR;
#define RCC_PLLCFGR_DIVR3EN_SHIFT       (24)
#define RCC_PLLCFGR_DIVR3EN_MASK        (1    << (RCC_PLLCFGR_DIVR3EN_SHIFT))
#define RCC_PLLCFGR_DIVR3EN_NO          (0    << (RCC_PLLCFGR_DIVR3EN_SHIFT))
#define RCC_PLLCFGR_DIVR3EN_YES         (1    << (RCC_PLLCFGR_DIVR3EN_SHIFT))
#define RCC_PLLCFGR_DIVQ3EN_SHIFT       (23)
#define RCC_PLLCFGR_DIVQ3EN_MASK        (1    << (RCC_PLLCFGR_DIVQ3EN_SHIFT))
#define RCC_PLLCFGR_DIVQ3EN_NO          (0    << (RCC_PLLCFGR_DIVQ3EN_SHIFT))
#define RCC_PLLCFGR_DIVQ3EN_YES         (1    << (RCC_PLLCFGR_DIVQ3EN_SHIFT))
#define RCC_PLLCFGR_DIVP3EN_SHIFT       (22)
#define RCC_PLLCFGR_DIVP3EN_MASK        (1    << (RCC_PLLCFGR_DIVP3EN_SHIFT))
#define RCC_PLLCFGR_DIVP3EN_NO          (0    << (RCC_PLLCFGR_DIVP3EN_SHIFT))
#define RCC_PLLCFGR_DIVP3EN_YES         (1    << (RCC_PLLCFGR_DIVP3EN_SHIFT))
#define RCC_PLLCFGR_DIVR2EN_SHIFT       (21)
#define RCC_PLLCFGR_DIVR2EN_MASK        (1    << (RCC_PLLCFGR_DIVR2EN_SHIFT))
#define RCC_PLLCFGR_DIVR2EN_NO          (0    << (RCC_PLLCFGR_DIVR2EN_SHIFT))
#define RCC_PLLCFGR_DIVR2EN_YES         (1    << (RCC_PLLCFGR_DIVR2EN_SHIFT))
#define RCC_PLLCFGR_DIVQ2EN_SHIFT       (20)
#define RCC_PLLCFGR_DIVQ2EN_MASK        (1    << (RCC_PLLCFGR_DIVQ2EN_SHIFT))
#define RCC_PLLCFGR_DIVQ2EN_NO          (0    << (RCC_PLLCFGR_DIVQ2EN_SHIFT))
#define RCC_PLLCFGR_DIVQ2EN_YES         (1    << (RCC_PLLCFGR_DIVQ2EN_SHIFT))
#define RCC_PLLCFGR_DIVP2EN_SHIFT       (19)
#define RCC_PLLCFGR_DIVP2EN_MASK        (1    << (RCC_PLLCFGR_DIVP2EN_SHIFT))
#define RCC_PLLCFGR_DIVP2EN_NO          (0    << (RCC_PLLCFGR_DIVP2EN_SHIFT))
#define RCC_PLLCFGR_DIVP2EN_YES         (1    << (RCC_PLLCFGR_DIVP2EN_SHIFT))
#define RCC_PLLCFGR_DIVR1EN_SHIFT       (18)
#define RCC_PLLCFGR_DIVR1EN_MASK        (1    << (RCC_PLLCFGR_DIVR1EN_SHIFT))
#define RCC_PLLCFGR_DIVR1EN_NO          (0    << (RCC_PLLCFGR_DIVR1EN_SHIFT))
#define RCC_PLLCFGR_DIVR1EN_YES         (1    << (RCC_PLLCFGR_DIVR1EN_SHIFT))
#define RCC_PLLCFGR_DIVQ1EN_SHIFT       (17)
#define RCC_PLLCFGR_DIVQ1EN_MASK        (1    << (RCC_PLLCFGR_DIVQ1EN_SHIFT))
#define RCC_PLLCFGR_DIVQ1EN_NO          (0    << (RCC_PLLCFGR_DIVQ1EN_SHIFT))
#define RCC_PLLCFGR_DIVQ1EN_YES         (1    << (RCC_PLLCFGR_DIVQ1EN_SHIFT))
#define RCC_PLLCFGR_DIVP1EN_SHIFT       (16)
#define RCC_PLLCFGR_DIVP1EN_MASK        (1    << (RCC_PLLCFGR_DIVP1EN_SHIFT))
#define RCC_PLLCFGR_DIVP1EN_NO          (0    << (RCC_PLLCFGR_DIVP1EN_SHIFT))
#define RCC_PLLCFGR_DIVP1EN_YES         (1    << (RCC_PLLCFGR_DIVP1EN_SHIFT))
#define RCC_PLLCFGR_PLL3RGE_SHIFT           (10)
#define RCC_PLLCFGR_PLL3RGE_MASK            (0x3  << (RCC_PLLCFGR_PLL3RGE_SHIFT))
#define RCC_PLLCFGR_PLL3RGE_1TO2MHZ         (0    << (RCC_PLLCFGR_PLL3RGE_SHIFT))
#define RCC_PLLCFGR_PLL3RGE_2TO4MHZ         (1    << (RCC_PLLCFGR_PLL3RGE_SHIFT))
#define RCC_PLLCFGR_PLL3RGE_4TO8MHZ         (2    << (RCC_PLLCFGR_PLL3RGE_SHIFT))
#define RCC_PLLCFGR_PLL3RGE_8TO16MHZ        (3    << (RCC_PLLCFGR_PLL3RGE_SHIFT))
#define RCC_PLLCFGR_PLL3VCOSEL_SHIFT        (9)
#define RCC_PLLCFGR_PLL3VCOSEL_MASK         (1    << (RCC_PLLCFGR_PLL3VCOSEL_SHIFT))
#define RCC_PLLCFGR_PLL3VCOSEL_192TO836MHZ  (0    << (RCC_PLLCFGR_PLL3VCOSEL_SHIFT))
#define RCC_PLLCFGR_PLL3VCOSEL_150TO420MHZ  (1    << (RCC_PLLCFGR_PLL3VCOSEL_SHIFT))
#define RCC_PLLCFGR_PLL3RFRACEN_SHIFT       (8)
#define RCC_PLLCFGR_PLL3RFRACEN_MASK        (1  << (RCC_PLLCFGR_PLL1RFRACEN_SHIFT))
#define RCC_PLLCFGR_PLL3RFRACEN_NO          (0  << (RCC_PLLCFGR_PLL1RFRACEN_SHIFT))
#define RCC_PLLCFGR_PLL3RFRACEN_YES         (1  << (RCC_PLLCFGR_PLL1RFRACEN_SHIFT))
#define RCC_PLLCFGR_PLL2RGE_SHIFT     (6)
#define RCC_PLLCFGR_PLL2RGE_MASK      (0x3  << (RCC_PLLCFGR_PLL2RGE_SHIFT))
#define RCC_PLLCFGR_PLL2RGE_1TO2MHZ   (0    << (RCC_PLLCFGR_PLL2RGE_SHIFT))
#define RCC_PLLCFGR_PLL2RGE_2TO4MHZ   (1    << (RCC_PLLCFGR_PLL2RGE_SHIFT))
#define RCC_PLLCFGR_PLL2RGE_4TO8MHZ   (2    << (RCC_PLLCFGR_PLL2RGE_SHIFT))
#define RCC_PLLCFGR_PLL2RGE_8TO16MHZ  (3    << (RCC_PLLCFGR_PLL2RGE_SHIFT))
#define RCC_PLLCFGR_PLL2VCOSEL_SHIFT        (5)
#define RCC_PLLCFGR_PLL2VCOSEL_MASK         (1    << (RCC_PLLCFGR_PLL2VCOSEL_SHIFT))
#define RCC_PLLCFGR_PLL2VCOSEL_192TO836MHZ  (0    << (RCC_PLLCFGR_PLL2VCOSEL_SHIFT))
#define RCC_PLLCFGR_PLL2VCOSEL_150TO420MHZ  (1    << (RCC_PLLCFGR_PLL2VCOSEL_SHIFT))
#define RCC_PLLCFGR_PLL2RFRACEN_SHIFT       (4)
#define RCC_PLLCFGR_PLL2RFRACEN_MASK        (1  << (RCC_PLLCFGR_PLL1RFRACEN_SHIFT))
#define RCC_PLLCFGR_PLL2RFRACEN_NO          (0  << (RCC_PLLCFGR_PLL1RFRACEN_SHIFT))
#define RCC_PLLCFGR_PLL2RFRACEN_YES         (1  << (RCC_PLLCFGR_PLL1RFRACEN_SHIFT))
#define RCC_PLLCFGR_PLL1RGE_SHIFT     (2)
#define RCC_PLLCFGR_PLL1RGE_MASK      (0x3  << (RCC_PLLCFGR_PLL1RGE_SHIFT))
#define RCC_PLLCFGR_PLL1RGE_1TO2MHZ   (0    << (RCC_PLLCFGR_PLL1RGE_SHIFT))
#define RCC_PLLCFGR_PLL1RGE_2TO4MHZ   (1    << (RCC_PLLCFGR_PLL1RGE_SHIFT))
#define RCC_PLLCFGR_PLL1RGE_4TO8MHZ   (2    << (RCC_PLLCFGR_PLL1RGE_SHIFT))
#define RCC_PLLCFGR_PLL1RGE_8TO16MHZ  (3    << (RCC_PLLCFGR_PLL1RGE_SHIFT))
#define RCC_PLLCFGR_PLL1VCOSEL_SHIFT        (1)
#define RCC_PLLCFGR_PLL1VCOSEL_MASK         (1  << (RCC_PLLCFGR_PLL1VCOSEL_SHIFT))
#define RCC_PLLCFGR_PLL1VCOSEL_192TO836MHZ  (0  << (RCC_PLLCFGR_PLL1VCOSEL_SHIFT))
#define RCC_PLLCFGR_PLL1VCOSEL_150TO420MHZ  (1  << (RCC_PLLCFGR_PLL1VCOSEL_SHIFT))
#define RCC_PLLCFGR_PLL1RFRACEN_SHIFT       (0)
#define RCC_PLLCFGR_PLL1RFRACEN_MASK        (1  << (RCC_PLLCFGR_PLL1RFRACEN_SHIFT))
#define RCC_PLLCFGR_PLL1RFRACEN_NO          (0  << (RCC_PLLCFGR_PLL1RFRACEN_SHIFT))
#define RCC_PLLCFGR_PLL1RFRACEN_YES         (1  << (RCC_PLLCFGR_PLL1RFRACEN_SHIFT))

/*** 0x030  RCC PLL1DIVR */
  __IO uint32_t         PLL1DIVR;
#define RCC_PLL1DIVR_DIVR1_SHIFT        (24)
#define RCC_PLL1DIVR_DIVR1_MASK         (0x7f << (RCC_PLL1DIVR_DIVR1_SHIFT))
#define RCC_PLL1DIVR_DIVR1(x)           ((x)  << (RCC_PLL1DIVR_DIVR1_SHIFT))
#define RCC_PLL1DIVR_DIVR1_VAL(x)       (RCC_PLL1DIVR_DIVR1((x)-1))
#define RCC_PLL1DIVR_DIVQ1_SHIFT        (16)
#define RCC_PLL1DIVR_DIVQ1_MASK         (0x7f << (RCC_PLL1DIVR_DIVQ1_SHIFT))
#define RCC_PLL1DIVR_DIVQ1(x)           ((x)  << (RCC_PLL1DIVR_DIVQ1_SHIFT))
#define RCC_PLL1DIVR_DIVQ1_VAL(x)       (RCC_PLL1DIVR_DIVQ1((x)-1))
#define RCC_PLL1DIVR_DIVP1_SHIFT        (9)
#define RCC_PLL1DIVR_DIVP1_MASK         (0x7f << (RCC_PLL1DIVR_DIVP1_SHIFT))
#define RCC_PLL1DIVR_DIVP1(x)           ((x)  << (RCC_PLL1DIVR_DIVP1_SHIFT))
#define RCC_PLL1DIVR_DIVP1_VAL(x)       (RCC_PLL1DIVR_DIVP1((x)-1))
#define RCC_PLL1DIVR_DIVN1_SHIFT        (0)
#define RCC_PLL1DIVR_DIVN1_MASK         (0x1ff << (RCC_PLL1DIVR_DIVN1_SHIFT))
#define RCC_PLL1DIVR_DIVN1(x)           ((x) << (RCC_PLL1DIVR_DIVN1_SHIFT))
#define RCC_PLL1DIVR_DIVN1_VAL(x)       (RCC_PLL1DIVR_DIVN1((x)-1))

/*** 0x034  RCC PLL1FRACR */
  __IO uint32_t         PLL1FRACR;
#define RCC_PLL1FRACR_FRACN1_SHIFT      (3)
#define RCC_PLL1FRACR_FRACN1_MASK       (0x1fff << (RCC_PLL1FRACR_FRACN1_SHIFT))
#define RCC_PLL1FRACR_FRACN1(x)         ((x)    << (RCC_PLL1FRACR_FRACN1_SHIFT))
#define RCC_PLL1FRACR_FRACN1_VALUE      8192

/*** 0x038  RCC PLL2DIVR */
  __IO uint32_t         PLL2DIVR;
#define RCC_PLL2DIVR_DIVR2_SHIFT        (24)
#define RCC_PLL2DIVR_DIVR2_MASK         (0x7f << (RCC_PLL2DIVR_DIVR2_SHIFT))
#define RCC_PLL2DIVR_DIVR2(x)           ((x)  << (RCC_PLL2DIVR_DIVR2_SHIFT))
#define RCC_PLL2DIVR_DIVR2_VAL(x)       (RCC_PLL2DIVR_DIVR2((x)-1))
#define RCC_PLL2DIVR_DIVQ2_SHIFT        (16)
#define RCC_PLL2DIVR_DIVQ2_MASK         (0x7f << (RCC_PLL2DIVR_DIVQ2_SHIFT))
#define RCC_PLL2DIVR_DIVQ2(x)           ((x)  << (RCC_PLL2DIVR_DIVQ2_SHIFT))
#define RCC_PLL2DIVR_DIVQ2_VAL(x)       (RCC_PLL2DIVR_DIVQ2((x)-1))
#define RCC_PLL2DIVR_DIVP2_SHIFT        (9)
#define RCC_PLL2DIVR_DIVP2_MASK         (0x7f << (RCC_PLL2DIVR_DIVP2_SHIFT))
#define RCC_PLL2DIVR_DIVP2(x)           ((x)  << (RCC_PLL2DIVR_DIVP2_SHIFT))
#define RCC_PLL2DIVR_DIVP2_VAL(x)       (RCC_PLL2DIVR_DIVP2((x)-1))
#define RCC_PLL2DIVR_DIVN2_SHIFT        (0)
#define RCC_PLL2DIVR_DIVN2_MASK         (0x1ff << (RCC_PLL2DIVR_DIVN2_SHIFT))
#define RCC_PLL2DIVR_DIVN2(x)           ((x)   << (RCC_PLL2DIVR_DIVN2_SHIFT))
#define RCC_PLL2DIVR_DIVN2_VAL(x)       (RCC_PLL2DIVR_DIVN2((x)-1))

/*** 0x03c  RCC PLL2FRACR */
  __IO uint32_t         PLL2FRACR;
#define RCC_PLL2FRACR_FRACN2_SHIFT      (3)
#define RCC_PLL2FRACR_FRACN2_MASK       (0x1fff << (RCC_PLL2FRACR_FRACN2_SHIFT))
#define RCC_PLL2FRACR_FRACN2(x)         ((x)    << (RCC_PLL2FRACR_FRACN2_SHIFT))
#define RCC_PLL2FRACR_FRACN2_VALUE      8192

