zhtlab/KICADKEY/subcpu/Devices/STM32H7/include/stm32h7Rcc.h
/*** 0x040  RCC PLL3DIVR */
  __IO uint32_t         PLL3DIVR;
#define RCC_PLL3DIVR_DIVR3_SHIFT        (24)
#define RCC_PLL3DIVR_DIVR3_MASK         (0x7f << (RCC_PLL3DIVR_DIVR3_SHIFT))
#define RCC_PLL3DIVR_DIVR3(x)           ((x)  << (RCC_PLL3DIVR_DIVR3_SHIFT))
#define RCC_PLL3DIVR_DIVR3_VAL(x)       (RCC_PLL3DIVR_DIVR3((x)-1))
#define RCC_PLL3DIVR_DIVQ3_SHIFT        (16)
#define RCC_PLL3DIVR_DIVQ3_MASK         (0x7f << (RCC_PLL3DIVR_DIVQ3_SHIFT))
#define RCC_PLL3DIVR_DIVQ3(x)           ((x)  << (RCC_PLL3DIVR_DIVQ3_SHIFT))
#define RCC_PLL3DIVR_DIVQ3_VAL(x)       (RCC_PLL3DIVR_DIVQ3((x)-1))
#define RCC_PLL3DIVR_DIVP3_SHIFT        (9)
#define RCC_PLL3DIVR_DIVP3_MASK         (0x7f << (RCC_PLL3DIVR_DIVP3_SHIFT))
#define RCC_PLL3DIVR_DIVP3(x)           ((x)  << (RCC_PLL3DIVR_DIVP3_SHIFT))
#define RCC_PLL3DIVR_DIVP3_VAL(x)       (RCC_PLL3DIVR_DIVP3((x)-1))
#define RCC_PLL3DIVR_DIVN3_SHIFT        (0)
#define RCC_PLL3DIVR_DIVN3_MASK         (0x1ff << (RCC_PLL3DIVR_DIVN3_SHIFT))
#define RCC_PLL3DIVR_DIVN3(x)           ((x)   << (RCC_PLL3DIVR_DIVN3_SHIFT))
#define RCC_PLL3DIVR_DIVN3_VAL(x)       (RCC_PLL3DIVR_DIVN3((x)-1))

/*** 0x044  RCC PLL3FRACR */
  __IO uint32_t         PLL3FRACR;
#define RCC_PLL3FRACR_FRACN3_SHIFT      (3)
#define RCC_PLL3FRACR_FRACN3_MASK       (0x1fff << (RCC_PLL3FRACR_FRACN3_SHIFT))
#define RCC_PLL3FRACR_FRACN3(x)         ((x)    << (RCC_PLL3FRACR_FRACN3_SHIFT))
#define RCC_PLL3FRACR_FRACN3_VALUE      8192

  uint32_t              reserved48;

/*** 0x04c  RCC D1CCIPR */
  __IO uint32_t         D1CCIPR;
#define RCC_D1CCIPR_CKPERSEL_SHIFT      (28)
#define RCC_D1CCIPR_CKPERSEL_MASK       (3 << (RCC_D1CCIPR_CKPERSEL_SHIFT))
#define RCC_D1CCIPR_CKPERSEL_HSI        (0 << (RCC_D1CCIPR_CKPERSEL_SHIFT))
#define RCC_D1CCIPR_CKPERSEL_CSI        (1 << (RCC_D1CCIPR_CKPERSEL_SHIFT))
#define RCC_D1CCIPR_CKPERSEL_HSE        (2 << (RCC_D1CCIPR_CKPERSEL_SHIFT))
#define RCC_D1CCIPR_CKPERSEL_RESERVED   (3 << (RCC_D1CCIPR_CKPERSEL_SHIFT))
#define RCC_D1CCIPR_SDMMCSEL_SHIFT      (16)
#define RCC_D1CCIPR_SDMMCSEL_MASK       (1 << (RCC_D1CCIPR_SDMMCSEL_SHIFT))
#define RCC_D1CCIPR_SDMMCSEL_PLL1Q      (0 << (RCC_D1CCIPR_SDMMCSEL_SHIFT))
#define RCC_D1CCIPR_SDMMCSEL_PLL2R      (1 << (RCC_D1CCIPR_SDMMCSEL_SHIFT))

#define RCC_D1CCIPR_QSPISEL_SHIFT       (4)
#define RCC_D1CCIPR_QSPISEL_MASK        (3 << (RCC_D1CCIPR_QSPISEL_SHIFT))
#define RCC_D1CCIPR_QSPISEL_HCLK3       (0 << (RCC_D1CCIPR_QSPISEL_SHIFT))
#define RCC_D1CCIPR_QSPISEL_PLL1Q       (1 << (RCC_D1CCIPR_QSPISEL_SHIFT))
#define RCC_D1CCIPR_QSPISEL_PLL2R       (2 << (RCC_D1CCIPR_QSPISEL_SHIFT))
#define RCC_D1CCIPR_QSPISEL_PERI        (3 << (RCC_D1CCIPR_QSPISEL_SHIFT))
#define RCC_D1CCIPR_FMCSEL_SHIFT        (0)
#define RCC_D1CCIPR_FMCSEL_MASK         (3 << (RCC_D1CCIPR_FMCSEL_SHIFT))
#define RCC_D1CCIPR_FMCSEL_HCLK3        (0 << (RCC_D1CCIPR_FMCSEL_SHIFT))
#define RCC_D1CCIPR_FMCSEL_PLL1Q        (1 << (RCC_D1CCIPR_FMCSEL_SHIFT))
#define RCC_D1CCIPR_FMCSEL_PLL2R        (2 << (RCC_D1CCIPR_FMCSEL_SHIFT))
#define RCC_D1CCIPR_FMCSEL_PERI         (3 << (RCC_D1CCIPR_FMCSEL_SHIFT))

/*** 0x050  RCC D2CCIP1R */
  __IO uint32_t         D2CCIP1R;
#define RCC_D2CCIP1R_SWPSEL_SHIFT       (31)
#define RCC_D2CCIP1R_SWPSEL_MASK        (1 << (RCC_D2CCIP1R_SWPSEL_SHIFT))
#define RCC_D2CCIP1R_SWPSEL_PLL2        (0 << (RCC_D2CCIP1R_SWPSEL_SHIFT))
#define RCC_D2CCIP1R_SWPSEL_SYS         (1 << (RCC_D2CCIP1R_SWPSEL_SHIFT))
#define RCC_D2CCIP1R_FDCANSEL_SHIFT     (28)
#define RCC_D2CCIP1R_FDCANSEL_MASK      (3 << (RCC_D2CCIP1R_FDCANSEL_SHIFT))
#define RCC_D2CCIP1R_FDCANSEL_HSE       (0 << (RCC_D2CCIP1R_FDCANSEL_SHIFT))
#define RCC_D2CCIP1R_FDCANSEL_PLL1Q     (1 << (RCC_D2CCIP1R_FDCANSEL_SHIFT))
#define RCC_D2CCIP1R_FDCANSEL_PLL2Q     (2 << (RCC_D2CCIP1R_FDCANSEL_SHIFT))
#define RCC_D2CCIP1R_FDCANSEL_RESERVED  (3 << (RCC_D2CCIP1R_FDCANSEL_SHIFT))
#define RCC_D2CCIP1R_DFSDM1SEL_SHIFT    (24)
#define RCC_D2CCIP1R_DFSDM1SEL_MASK     (1 << (RCC_D2CCIP1R_DFSDM1SEL_SHIFT))
#define RCC_D2CCIP1R_DFSDM1SEL_PLL2     (0 << (RCC_D2CCIP1R_DFSDM1SEL_SHIFT))
#define RCC_D2CCIP1R_DFSDM1SEL_SYS      (1 << (RCC_D2CCIP1R_DFSDM1SEL_SHIFT))
#define RCC_D2CCIP1R_SPDIFSEL_SHIFT     (20)
#define RCC_D2CCIP1R_SPDIFSEL_MASK      (3 << (RCC_D2CCIP1R_SPDIFSEL_SHIFT))
#define RCC_D2CCIP1R_SPDIFSEL_PLL1Q     (0 << (RCC_D2CCIP1R_SPDIFSEL_SHIFT))
#define RCC_D2CCIP1R_SPDIFSEL_PLL2R     (1 << (RCC_D2CCIP1R_SPDIFSEL_SHIFT))
#define RCC_D2CCIP1R_SPDIFSEL_PLL3R     (2 << (RCC_D2CCIP1R_SPDIFSEL_SHIFT))
#define RCC_D2CCIP1R_SPDIFSEL_HSI       (3 << (RCC_D2CCIP1R_SPDIFSEL_SHIFT))
#define RCC_D2CCIP1R_SPI45SEL_SHIFT     (16)
#define RCC_D2CCIP1R_SPI45SEL_MASK      (7 << (RCC_D2CCIP1R_SPI45SEL_SHIFT))
#define RCC_D2CCIP1R_SPI45SEL_APB       (0 << (RCC_D2CCIP1R_SPI45SEL_SHIFT))
#define RCC_D2CCIP1R_SPI45SEL_PLL2Q     (1 << (RCC_D2CCIP1R_SPI45SEL_SHIFT))
#define RCC_D2CCIP1R_SPI45SEL_PLL3Q     (2 << (RCC_D2CCIP1R_SPI45SEL_SHIFT))
#define RCC_D2CCIP1R_SPI45SEL_HSI       (3 << (RCC_D2CCIP1R_SPI45SEL_SHIFT))
#define RCC_D2CCIP1R_SPI45SEL_CSI       (4 << (RCC_D2CCIP1R_SPI45SEL_SHIFT))
#define RCC_D2CCIP1R_SPI45SEL_HSE       (5 << (RCC_D2CCIP1R_SPI45SEL_SHIFT))
#define RCC_D2CCIP1R_SPI123SEL_SHIFT    (12)
#define RCC_D2CCIP1R_SPI123SEL_MASK     (7 << (RCC_D2CCIP1R_SPI123SEL_SHIFT))
#define RCC_D2CCIP1R_SPI123SEL_PLL1Q    (0 << (RCC_D2CCIP1R_SPI123SEL_SHIFT))
#define RCC_D2CCIP1R_SPI123SEL_PLL2P    (1 << (RCC_D2CCIP1R_SPI123SEL_SHIFT))
#define RCC_D2CCIP1R_SPI123SEL_PLL3P    (2 << (RCC_D2CCIP1R_SPI123SEL_SHIFT))
#define RCC_D2CCIP1R_SPI123SEL_I2SCLKIN (3 << (RCC_D2CCIP1R_SPI123SEL_SHIFT))
#define RCC_D2CCIP1R_SPI123SEL_PERI     (4 << (RCC_D2CCIP1R_SPI123SEL_SHIFT))
#define RCC_D2CCIP1R_SAI2SEL_SHIFT      (6)
#define RCC_D2CCIP1R_SAI2SEL_MASK       (7 << (RCC_D2CCIP1R_SAI2SEL_SHIFT))
#define RCC_D2CCIP1R_SAI2SEL_PLL1Q      (0 << (RCC_D2CCIP1R_SAI2SEL_SHIFT))
#define RCC_D2CCIP1R_SAI2SEL_PLL2P      (1 << (RCC_D2CCIP1R_SAI2SEL_SHIFT))
#define RCC_D2CCIP1R_SAI2SEL_PLL3P      (2 << (RCC_D2CCIP1R_SAI2SEL_SHIFT))
#define RCC_D2CCIP1R_SAI2SEL_I2SCLKIN   (3 << (RCC_D2CCIP1R_SAI2SEL_SHIFT))
#define RCC_D2CCIP1R_SAI2SEL_PERI       (4 << (RCC_D2CCIP1R_SAI2SEL_SHIFT))
#define RCC_D2CCIP1R_SAI1SEL_SHIFT      (0)
#define RCC_D2CCIP1R_SAI1SEL_MASK       (7 << (RCC_D2CCIP1R_SAI1SEL_SHIFT))
#define RCC_D2CCIP1R_SAI1SEL_PLL1Q      (0 << (RCC_D2CCIP1R_SAI1SEL_SHIFT))
#define RCC_D2CCIP1R_SAI1SEL_PLL2P      (1 << (RCC_D2CCIP1R_SAI1SEL_SHIFT))
#define RCC_D2CCIP1R_SAI1SEL_PLL3P      (2 << (RCC_D2CCIP1R_SAI1SEL_SHIFT))
#define RCC_D2CCIP1R_SAI1SEL_I2SCLKIN   (3 << (RCC_D2CCIP1R_SAI1SEL_SHIFT))
#define RCC_D2CCIP1R_SAI1SEL_PERI       (4 << (RCC_D2CCIP1R_SAI1SEL_SHIFT))


/*** 0x054  RCC D2CCIP2R */
  __IO uint32_t         D2CCIP2R;
#define RCC_D2CCIP2R_LPTIM1SEL_SHIFT    (28)
#define RCC_D2CCIP2R_LPTIM1SEL_MASK     (7 << (RCC_D2CCIP2R_LPTIM1SEL_SHIFT))
#define RCC_D2CCIP2R_LPTIM1SEL_PCLK1    (0 << (RCC_D2CCIP2R_LPTIM1SEL_SHIFT))
#define RCC_D2CCIP2R_LPTIM1SEL_PLL2P    (1 << (RCC_D2CCIP2R_LPTIM1SEL_SHIFT))
#define RCC_D2CCIP2R_LPTIM1SEL_PLL3R    (2 << (RCC_D2CCIP2R_LPTIM1SEL_SHIFT))
#define RCC_D2CCIP2R_LPTIM1SEL_LSE      (3 << (RCC_D2CCIP2R_LPTIM1SEL_SHIFT))
#define RCC_D2CCIP2R_LPTIM1SEL_LSI      (4 << (RCC_D2CCIP2R_LPTIM1SEL_SHIFT))
#define RCC_D2CCIP2R_LPTIM1SEL_PERCK    (5 << (RCC_D2CCIP2R_LPTIM1SEL_SHIFT))
#define RCC_D2CCIP2R_CECSEL_SHIFT       (22)
#define RCC_D2CCIP2R_CECSEL_MASK        (3 << (RCC_D2CCIP2R_CECSEL_SHIFT))
#define RCC_D2CCIP2R_CECSEL_LSE         (0 << (RCC_D2CCIP2R_CECSEL_SHIFT))
#define RCC_D2CCIP2R_CECSEL_LSI         (1 << (RCC_D2CCIP2R_CECSEL_SHIFT))
#define RCC_D2CCIP2R_CECSEL_CSI         (2 << (RCC_D2CCIP2R_CECSEL_SHIFT))
#define RCC_D2CCIP2R_CECSEL_DISABLE     (3 << (RCC_D2CCIP2R_CECSEL_SHIFT))
#define RCC_D2CCIP2R_USBSEL_SHIFT       (20)
#define RCC_D2CCIP2R_USBSEL_MASK        (3 << (RCC_D2CCIP2R_USBSEL_SHIFT))
#define RCC_D2CCIP2R_USBSEL_DISABLE     (0 << (RCC_D2CCIP2R_USBSEL_SHIFT))
#define RCC_D2CCIP2R_USBSEL_PLL1Q       (1 << (RCC_D2CCIP2R_USBSEL_SHIFT))
#define RCC_D2CCIP2R_USBSEL_PLL3Q       (2 << (RCC_D2CCIP2R_USBSEL_SHIFT))
#define RCC_D2CCIP2R_USBSEL_HSI48       (3 << (RCC_D2CCIP2R_USBSEL_SHIFT))
#define RCC_D2CCIP2R_I2C123SEL_SHIFT    (12)
#define RCC_D2CCIP2R_I2C123SEL_MASK     (3 << (RCC_D2CCIP2R_I2C123SEL_SHIFT))
#define RCC_D2CCIP2R_I2C123SEL_PCLK1    (0 << (RCC_D2CCIP2R_I2C123SEL_SHIFT))
#define RCC_D2CCIP2R_I2C123SEL_PLL3R    (1 << (RCC_D2CCIP2R_I2C123SEL_SHIFT))
#define RCC_D2CCIP2R_I2C123SEL_HSI      (2 << (RCC_D2CCIP2R_I2C123SEL_SHIFT))
#define RCC_D2CCIP2R_I2C123SEL_CSI      (3 << (RCC_D2CCIP2R_I2C123SEL_SHIFT))
#define RCC_D2CCIP2R_RNGSEL_SHIFT       (8)
#define RCC_D2CCIP2R_RNGSEL_MASK        (3 << (RCC_D2CCIP2R_RNGSEL_SHIFT))
#define RCC_D2CCIP2R_RNGSEL_HSI48       (0 << (RCC_D2CCIP2R_RNGSEL_SHIFT))
#define RCC_D2CCIP2R_RNGSEL_PLL1Q       (1 << (RCC_D2CCIP2R_RNGSEL_SHIFT))
#define RCC_D2CCIP2R_RNGSEL_LSE         (2 << (RCC_D2CCIP2R_RNGSEL_SHIFT))
#define RCC_D2CCIP2R_RNGSEL_LSI         (3 << (RCC_D2CCIP2R_RNGSEL_SHIFT))
#define RCC_D2CCIP2R_USART16SEL_SHIFT   (3)
#define RCC_D2CCIP2R_USART16SEL_MASK    (7 << (RCC_D2CCIP2R_USART16SEL_SHIFT))
#define RCC_D2CCIP2R_USART16SEL_PCLK2   (0 << (RCC_D2CCIP2R_USART16SEL_SHIFT))
#define RCC_D2CCIP2R_USART16SEL_PLL2Q   (1 << (RCC_D2CCIP2R_USART16SEL_SHIFT))
#define RCC_D2CCIP2R_USART16SEL_PLL3Q   (2 << (RCC_D2CCIP2R_USART16SEL_SHIFT))
#define RCC_D2CCIP2R_USART16SEL_HSI     (3 << (RCC_D2CCIP2R_USART16SEL_SHIFT))
#define RCC_D2CCIP2R_USART16SEL_CSI     (4 << (RCC_D2CCIP2R_USART16SEL_SHIFT))
#define RCC_D2CCIP2R_USART16SEL_LSE     (5 << (RCC_D2CCIP2R_USART16SEL_SHIFT))
#define RCC_D2CCIP2R_USART234578SEL_SHIFT (0)
#define RCC_D2CCIP2R_USART234578SEL_MASK  (7 << (RCC_D2CCIP2R_USART234578SEL_SHIFT))
#define RCC_D2CCIP2R_USART234578SEL_PCLK1 (0 << (RCC_D2CCIP2R_USART234578SEL_SHIFT))
#define RCC_D2CCIP2R_USART234578SEL_PLL2Q (1 << (RCC_D2CCIP2R_USART234578SEL_SHIFT))
#define RCC_D2CCIP2R_USART234578SEL_PLL3Q (2 << (RCC_D2CCIP2R_USART234578SEL_SHIFT))
#define RCC_D2CCIP2R_USART234578SEL_HSI (3 << (RCC_D2CCIP2R_USART234578SEL_SHIFT))
#define RCC_D2CCIP2R_USART234578SEL_CSI (4 << (RCC_D2CCIP2R_USART234578SEL_SHIFT))
#define RCC_D2CCIP2R_USART234578SEL_LSE (5 << (RCC_D2CCIP2R_USART234578SEL_SHIFT))

/*** 0x058  RCC D3CCIPR */
  __IO uint32_t         D3CCIPR;
#define RCC_D3CCIPR_SPI6SEL_SHIFT       (28)
#define RCC_D3CCIPR_SPI6SEL_MASK        (7 << (RCC_D3CCIPR_SPI6SEL_SHIFT))
#define RCC_D3CCIPR_SPI6SEL_PCLK4       (0 << (RCC_D3CCIPR_SPI6SEL_SHIFT))
#define RCC_D3CCIPR_SPI6SEL_PLL2Q       (1 << (RCC_D3CCIPR_SPI6SEL_SHIFT))
#define RCC_D3CCIPR_SPI6SEL_PLL3Q       (2 << (RCC_D3CCIPR_SPI6SEL_SHIFT))
#define RCC_D3CCIPR_SPI6SEL_HSI         (3 << (RCC_D3CCIPR_SPI6SEL_SHIFT))
#define RCC_D3CCIPR_SPI6SEL_CSI         (4 << (RCC_D3CCIPR_SPI6SEL_SHIFT))
#define RCC_D3CCIPR_SPI6SEL_HSE         (5 << (RCC_D3CCIPR_SPI6SEL_SHIFT))
#define RCC_D3CCIPR_SAI4BSEL_SHIFT      (24)
#define RCC_D3CCIPR_SAI4BSEL_MASK       (7 << (RCC_D3CCIPR_SAI4BSEL_SHIFT))
#define RCC_D3CCIPR_SAI4BSEL_PLL1Q      (0 << (RCC_D3CCIPR_SAI4BSEL_SHIFT))
#define RCC_D3CCIPR_SAI4BSEL_PLL2P      (1 << (RCC_D3CCIPR_SAI4BSEL_SHIFT))
#define RCC_D3CCIPR_SAI4BSEL_PLL3P      (2 << (RCC_D3CCIPR_SAI4BSEL_SHIFT))
#define RCC_D3CCIPR_SAI4BSEL_I2SCLKIN   (3 << (RCC_D3CCIPR_SAI4BSEL_SHIFT))
#define RCC_D3CCIPR_SAI4BSEL_PERI       (4 << (RCC_D3CCIPR_SAI4BSEL_SHIFT))
#define RCC_D3CCIPR_SAI4ASEL_SHIFT      (21)
#define RCC_D3CCIPR_SAI4ASEL_MASK       (7 << (RCC_D3CCIPR_SAI4ASEL_SHIFT))
#define RCC_D3CCIPR_SAI4ASEL_PLL1Q      (0 << (RCC_D3CCIPR_SAI4ASEL_SHIFT))
#define RCC_D3CCIPR_SAI4ASEL_PLL2P      (1 << (RCC_D3CCIPR_SAI4ASEL_SHIFT))
#define RCC_D3CCIPR_SAI4ASEL_PLL3P      (2 << (RCC_D3CCIPR_SAI4ASEL_SHIFT))
#define RCC_D3CCIPR_SAI4ASEL_I2SCLKIN   (3 << (RCC_D3CCIPR_SAI4ASEL_SHIFT))
#define RCC_D3CCIPR_ADCSEL_SHIFT        (16)
#define RCC_D3CCIPR_ADCSEL_MASK         (3 << (RCC_D3CCIPR_ADCSEL_SHIFT))
#define RCC_D3CCIPR_ADCSEL_PLL2P        (0 << (RCC_D3CCIPR_ADCSEL_SHIFT))
#define RCC_D3CCIPR_ADCSEL_PLL3R        (1 << (RCC_D3CCIPR_ADCSEL_SHIFT))
#define RCC_D3CCIPR_ADCSEL_PERI         (2 << (RCC_D3CCIPR_ADCSEL_SHIFT))
#define RCC_D3CCIPR_ADCSEL_RESERVED     (3 << (RCC_D3CCIPR_ADCSEL_SHIFT))
#define RCC_D3CCIPR_LPTIM345SEL_SHIFT   (13)
#define RCC_D3CCIPR_LPTIM345SEL_MASK    (7 << (RCC_D3CCIPR_LPTIM345SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM345SEL_PLL4    (0 << (RCC_D3CCIPR_LPTIM345SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM345SEL_PLL2P   (1 << (RCC_D3CCIPR_LPTIM345SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM345SEL_PLL3R   (2 << (RCC_D3CCIPR_LPTIM345SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM345SEL_LSE     (3 << (RCC_D3CCIPR_LPTIM345SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM345SEL_LSI     (4 << (RCC_D3CCIPR_LPTIM345SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM345SEL_PERI    (5 << (RCC_D3CCIPR_LPTIM345SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM2SEL_SHIFT     (10)
#define RCC_D3CCIPR_LPTIM2SEL_MASK      (7 << (RCC_D3CCIPR_LPTIM2SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM2SEL_PLL4      (0 << (RCC_D3CCIPR_LPTIM2SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM2SEL_PLL2P     (1 << (RCC_D3CCIPR_LPTIM2SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM2SEL_PLL3R     (2 << (RCC_D3CCIPR_LPTIM2SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM2SEL_LSE       (3 << (RCC_D3CCIPR_LPTIM2SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM2SEL_LSI       (4 << (RCC_D3CCIPR_LPTIM2SEL_SHIFT))
#define RCC_D3CCIPR_LPTIM2SEL_PERI      (4 << (RCC_D3CCIPR_LPTIM2SEL_SHIFT))
#define RCC_D3CCIPR_I2C4SEL_SHIFT       (8)
#define RCC_D3CCIPR_I2C4SEL_MASK        (3 << (RCC_D3CCIPR_I2C4SEL_SHIFT))
#define RCC_D3CCIPR_I2C4SEL_PCLK4       (0 << (RCC_D3CCIPR_I2C4SEL_SHIFT))
#define RCC_D3CCIPR_I2C4SEL_PLL3R       (1 << (RCC_D3CCIPR_I2C4SEL_SHIFT))
#define RCC_D3CCIPR_I2C4SEL_HSI         (2 << (RCC_D3CCIPR_I2C4SEL_SHIFT))
#define RCC_D3CCIPR_I2C4SEL_CSI         (3 << (RCC_D3CCIPR_I2C4SEL_SHIFT))
#define RCC_D3CCIPR_LPUART1SEL_SHIFT    (0)
#define RCC_D3CCIPR_LPUART1SEL_MASK     (3 << (RCC_D3CCIPR_LPUART1SEL_SHIFT))
#define RCC_D3CCIPR_LPUART1SEL_PCLK_D3  (0 << (RCC_D3CCIPR_LPUART1SEL_SHIFT))
#define RCC_D3CCIPR_LPUART1SEL_PLL2Q    (1 << (RCC_D3CCIPR_LPUART1SEL_SHIFT))
#define RCC_D3CCIPR_LPUART1SEL_PLL3Q    (2 << (RCC_D3CCIPR_LPUART1SEL_SHIFT))
#define RCC_D3CCIPR_LPUART1SEL_HSI      (3 << (RCC_D3CCIPR_LPUART1SEL_SHIFT))
#define RCC_D3CCIPR_LPUART1SEL_CSI      (4 << (RCC_D3CCIPR_LPUART1SEL_SHIFT))
#define RCC_D3CCIPR_LPUART1SEL_LSE      (5 << (RCC_D3CCIPR_LPUART1SEL_SHIFT))

