zhtlab/KICADKEY/subcpu/Devices/STM32H7/include/stm32h7Rcc.h
  uint32_t              resserved5c;
  __IO uint32_t         CIER;           /* 0x60 */
  __IO uint32_t         CIFR;           /* 0x64 */
  __IO uint32_t         CICR;           /* 0x68 */
  uint32_t              resserved6c;
  __IO uint32_t         BDCR;           /* 0x70 */
  __IO uint32_t         CSR;            /* 0x74 */
  uint32_t              resserved78;
  __IO uint32_t         AHB3RSTR;       /* 0x7c */
  __IO uint32_t         AHB1RSTR;       /* 0x80 */
  __IO uint32_t         AHB2RSTR;       /* 0x84 */
  __IO uint32_t         AHB4RSTR;       /* 0x88 */
  __IO uint32_t         APB3RSTR;       /* 0x8c */
  __IO uint32_t         APB1LRSTR;      /* 0x90 */
  __IO uint32_t         APB1HRSTR;      /* 0x94 */
#define RCC_APB1HRSTR_FDCANEN_SHIFT     (8)
#define RCC_APB1HRSTR_FDCANEN_MASK      (1 << (RCC_APB1HRSTR_FDCANEN_SHIFT))
#define RCC_APB1HRSTR_FDCANEN_NO        (0 << (RCC_APB1HRSTR_FDCANEN_SHIFT))
#define RCC_APB1HRSTR_FDCANEN_YES       (1 << (RCC_APB1HRSTR_FDCANEN_SHIFT))
#define RCC_APB1HRSTR_MDIOSEN_SHIFT     (5)
#define RCC_APB1HRSTR_MDIOSEN_MASK      (1 << (RCC_APB1HRSTR_MDIOSEN_SHIFT))
#define RCC_APB1HRSTR_MDIOSEN_NO        (0 << (RCC_APB1HRSTR_MDIOSEN_SHIFT))
#define RCC_APB1HRSTR_MDIOSEN_YES       (1 << (RCC_APB1HRSTR_MDIOSEN_SHIFT))
#define RCC_APB1HRSTR_OPAMPEN_SHIFT     (4)
#define RCC_APB1HRSTR_OPAMPEN_MASK      (1 << (RCC_APB1HRSTR_OPAMPEN_SHIFT))
#define RCC_APB1HRSTR_OPAMPEN_NO        (0 << (RCC_APB1HRSTR_OPAMPEN_SHIFT))
#define RCC_APB1HRSTR_OPAMPEN_YES       (1 << (RCC_APB1HRSTR_OPAMPEN_SHIFT))
#define RCC_APB1HRSTR_SWPRST_SHIFT      (2)
#define RCC_APB1HRSTR_SWPRST_MASK       (1 << (RCC_APB1HRSTR_SWPRST_SHIFT))
#define RCC_APB1HRSTR_SWPRST_NO         (0 << (RCC_APB1HRSTR_SWPRST_SHIFT))
#define RCC_APB1HRSTR_SWPRST_YES        (1 << (RCC_APB1HRSTR_SWPRST_SHIFT))
#define RCC_APB1HRSTR_CRSRST_SHIFT      (1)
#define RCC_APB1HRSTR_CRSRST_MASK       (1 << (RCC_APB1HRSTR_CRSRST_SHIFT))
#define RCC_APB1HRSTR_CRSRST_NO         (0 << (RCC_APB1HRSTR_CRSRST_SHIFT))
#define RCC_APB1HRSTR_CRSRST_YES        (1 << (RCC_APB1HRSTR_CRSRST_SHIFT))

  __IO uint32_t         APB2RSTR;       /* 0x98 */
  __IO uint32_t         APB4RSTR;       /* 0x9c */
  __IO uint32_t         GCR;            /* 0xa0 */
  uint32_t              resserveda4;
  __IO uint32_t         D3AMR;          /* 0xa8 */
  uint32_t              resserveac[9];
  __IO uint32_t         RSR;            /* 0xd0 */
  __IO uint32_t         AHB3ENR;        /* 0xd4 */
#define RCC_AHB3ENR_FMCEN_SHIFT         (12)
#define RCC_AHB3ENR_FMCEN_MASK          (1 << (RCC_AHB3ENR_FMCEN_SHIFT))
#define RCC_AHB3ENR_FMCEN_NO            (0 << (RCC_AHB3ENR_FMCEN_SHIFT))
#define RCC_AHB3ENR_FMCEN_YES           (1 << (RCC_AHB3ENR_FMCEN_SHIFT))
#define RCC_AHB3ENR_DMA2DEN_SHIFT       (4)
#define RCC_AHB3ENR_DMA2DEN_MASK        (1 << (RCC_AHB3ENR_DMA2DEN_SHIFT))
#define RCC_AHB3ENR_DMA2DEN_NO          (0 << (RCC_AHB3ENR_DMA2DEN_SHIFT))
#define RCC_AHB3ENR_DMA2DEN_YES         (1 << (RCC_AHB3ENR_DMA2DEN_SHIFT))
#define RCC_AHB3ENR_MDMAEN_SHIFT        (0)
#define RCC_AHB3ENR_MDMAEN_MASK         (1 << (RCC_AHB3ENR_MDMAEN_SHIFT))
#define RCC_AHB3ENR_MDMAEN_NO           (0 << (RCC_AHB3ENR_MDMAEN_SHIFT))
#define RCC_AHB3ENR_MDMAEN_YES          (1 << (RCC_AHB3ENR_MDMAEN_SHIFT))
  __IO uint32_t         AHB1ENR;        /* 0xd8 */
#define RCC_AHB1ENR_USB2ULPIEN_SHIFT    (28)
#define RCC_AHB1ENR_USB2ULPIEN_MASK     (1 << (RCC_AHB1ENR_USB2ULPIEN_SHIFT))
#define RCC_AHB1ENR_USB2ULPIEN_NO       (0 << (RCC_AHB1ENR_USB2ULPIEN_SHIFT))
#define RCC_AHB1ENR_USB2ULPIEN_YES      (1 << (RCC_AHB1ENR_USB2ULPIEN_SHIFT))
#define RCC_AHB1ENR_USB2OTGEN_SHIFT     (27)
#define RCC_AHB1ENR_USB2OTGEN_MASK      (1 << (RCC_AHB1ENR_USB2OTGEN_SHIFT))
#define RCC_AHB1ENR_USB2OTGEN_NO        (0 << (RCC_AHB1ENR_USB2OTGEN_SHIFT))
#define RCC_AHB1ENR_USB2OTGEN_YES       (1 << (RCC_AHB1ENR_USB2OTGEN_SHIFT))
#define RCC_AHB1ENR_USB1ULPIEN_SHIFT    (26)
#define RCC_AHB1ENR_USB1ULPIEN_MASK     (1 << (RCC_AHB1ENR_USB1ULPIEN_SHIFT))
#define RCC_AHB1ENR_USB1ULPIEN_NO       (0 << (RCC_AHB1ENR_USB1ULPIEN_SHIFT))
#define RCC_AHB1ENR_USB1ULPIEN_YES      (1 << (RCC_AHB1ENR_USB1ULPIEN_SHIFT))
#define RCC_AHB1ENR_USB1OTGEN_SHIFT     (25)
#define RCC_AHB1ENR_USB1OTGEN_MASK      (1 << (RCC_AHB1ENR_USB1OTGEN_SHIFT))
#define RCC_AHB1ENR_USB1OTGEN_NO        (0 << (RCC_AHB1ENR_USB1OTGEN_SHIFT))
#define RCC_AHB1ENR_USB1OTGEN_YES       (1 << (RCC_AHB1ENR_USB1OTGEN_SHIFT))
#define RCC_AHB1ENR_ADC12EN_SHIFT       (5)
#define RCC_AHB1ENR_ADC12EN_MASK        (1 << (RCC_AHB1ENR_ADC12EN_SHIFT))
#define RCC_AHB1ENR_ADC12EN_NO          (0 << (RCC_AHB1ENR_ADC12EN_SHIFT))
#define RCC_AHB1ENR_ADC12EN_YES         (1 << (RCC_AHB1ENR_ADC12EN_SHIFT))
#define RCC_AHB1ENR_DMA2EN_SHIFT        (1)
#define RCC_AHB1ENR_DMA2EN_MASK         (1 << (RCC_AHB1ENR_DMA2EN_SHIFT))
#define RCC_AHB1ENR_DMA2EN_NO           (0 << (RCC_AHB1ENR_DMA2EN_SHIFT))
#define RCC_AHB1ENR_DMA2EN_YES          (1 << (RCC_AHB1ENR_DMA2EN_SHIFT))
#define RCC_AHB1ENR_DMA1EN_SHIFT        (0)
#define RCC_AHB1ENR_DMA1EN_MASK         (1 << (RCC_AHB1ENR_DMA1EN_SHIFT))
#define RCC_AHB1ENR_DMA1EN_NO           (0 << (RCC_AHB1ENR_DMA1EN_SHIFT))
#define RCC_AHB1ENR_DMA1EN_YES          (1 << (RCC_AHB1ENR_DMA1EN_SHIFT))
  __IO uint32_t         AHB2ENR;        /* 0xdc */
  __IO uint32_t         AHB4ENR;        /* 0xe0 */

#define RCC_AHB4ENR_GPIOKEN_SHIFT        (10)
#define RCC_AHB4ENR_GPIOKEN_MASK        (1 << (RCC_AHB4ENR_GPIOKEN_SHIFT))
#define RCC_AHB4ENR_GPIOKEN_NO          (0 << (RCC_AHB4ENR_GPIOKEN_SHIFT))
#define RCC_AHB4ENR_GPIOKEN_YES         (1 << (RCC_AHB4ENR_GPIOKEN_SHIFT))
#define RCC_AHB4ENR_GPIOJEN_SHIFT       (9)
#define RCC_AHB4ENR_GPIOJEN_MASK        (1 << (RCC_AHB4ENR_GPIOJEN_SHIFT))
#define RCC_AHB4ENR_GPIOJEN_NO          (0 << (RCC_AHB4ENR_GPIOJEN_SHIFT))
#define RCC_AHB4ENR_GPIOJEN_YES         (1 << (RCC_AHB4ENR_GPIOJEN_SHIFT))
#define RCC_AHB4ENR_GPIOIEN_SHIFT       (8)
#define RCC_AHB4ENR_GPIOIEN_MASK        (1 << (RCC_AHB4ENR_GPIOIEN_SHIFT))
#define RCC_AHB4ENR_GPIOIEN_NO          (0 << (RCC_AHB4ENR_GPIOIEN_SHIFT))
#define RCC_AHB4ENR_GPIOIEN_YES         (1 << (RCC_AHB4ENR_GPIOIEN_SHIFT))
#define RCC_AHB4ENR_GPIOHEN_SHIFT       (7)
#define RCC_AHB4ENR_GPIOHEN_MASK        (1 << (RCC_AHB4ENR_GPIOHEN_SHIFT))
#define RCC_AHB4ENR_GPIOHEN_NO          (0 << (RCC_AHB4ENR_GPIOHEN_SHIFT))
#define RCC_AHB4ENR_GPIOHEN_YES         (1 << (RCC_AHB4ENR_GPIOHEN_SHIFT))
#define RCC_AHB4ENR_GPIOGEN_SHIFT       (6)
#define RCC_AHB4ENR_GPIOGEN_MASK        (1 << (RCC_AHB4ENR_GPIOGEN_SHIFT))
#define RCC_AHB4ENR_GPIOGEN_NO          (0 << (RCC_AHB4ENR_GPIOGEN_SHIFT))
#define RCC_AHB4ENR_GPIOGEN_YES         (1 << (RCC_AHB4ENR_GPIOGEN_SHIFT))
#define RCC_AHB4ENR_GPIOFEN_SHIFT       (5)
#define RCC_AHB4ENR_GPIOFEN_MASK        (1 << (RCC_AHB4ENR_GPIOFEN_SHIFT))
#define RCC_AHB4ENR_GPIOFEN_NO          (0 << (RCC_AHB4ENR_GPIOFEN_SHIFT))
#define RCC_AHB4ENR_GPIOFEN_YES         (1 << (RCC_AHB4ENR_GPIOFEN_SHIFT))
#define RCC_AHB4ENR_GPIOEEN_SHIFT       (4)
#define RCC_AHB4ENR_GPIOEEN_MASK        (1 << (RCC_AHB4ENR_GPIOEEN_SHIFT))
#define RCC_AHB4ENR_GPIOEEN_NO          (0 << (RCC_AHB4ENR_GPIOEEN_SHIFT))
#define RCC_AHB4ENR_GPIOEEN_YES         (1 << (RCC_AHB4ENR_GPIOEEN_SHIFT))
#define RCC_AHB4ENR_GPIODEN_SHIFT       (3)
#define RCC_AHB4ENR_GPIODEN_MASK        (1 << (RCC_AHB4ENR_GPIODEN_SHIFT))
#define RCC_AHB4ENR_GPIODEN_NO          (0 << (RCC_AHB4ENR_GPIODEN_SHIFT))
#define RCC_AHB4ENR_GPIODEN_YES         (1 << (RCC_AHB4ENR_GPIODEN_SHIFT))
#define RCC_AHB4ENR_GPIOCEN_SHIFT       (2)
#define RCC_AHB4ENR_GPIOCEN_MASK        (1 << (RCC_AHB4ENR_GPIOCEN_SHIFT))
#define RCC_AHB4ENR_GPIOCEN_NO          (0 << (RCC_AHB4ENR_GPIOCEN_SHIFT))
#define RCC_AHB4ENR_GPIOCEN_YES         (1 << (RCC_AHB4ENR_GPIOCEN_SHIFT))
#define RCC_AHB4ENR_GPIOBEN_SHIFT       (1)
#define RCC_AHB4ENR_GPIOBEN_MASK        (1 << (RCC_AHB4ENR_GPIOBEN_SHIFT))
#define RCC_AHB4ENR_GPIOBEN_NO          (0 << (RCC_AHB4ENR_GPIOBEN_SHIFT))
#define RCC_AHB4ENR_GPIOBEN_YES         (1 << (RCC_AHB4ENR_GPIOBEN_SHIFT))
#define RCC_AHB4ENR_GPIOAEN_SHIFT       (0)
#define RCC_AHB4ENR_GPIOAEN_MASK        (1 << (RCC_AHB4ENR_GPIOAEN_SHIFT))
#define RCC_AHB4ENR_GPIOAEN_NO          (0 << (RCC_AHB4ENR_GPIOAEN_SHIFT))
#define RCC_AHB4ENR_GPIOAEN_YES         (1 << (RCC_AHB4ENR_GPIOAEN_SHIFT))

  __IO uint32_t         APB3ENR;        /* 0xe4 */
  __IO uint32_t         APB1LENR;       /* 0xe8 */
#define RCC_APB1LENR_DAC12EN_SHIFT      (29)
#define RCC_APB1LENR_DAC12EN_MASK       (1 << (RCC_APB1LENR_DAC12EN_SHIFT))
#define RCC_APB1LENR_DAC12EN_NO         (0 << (RCC_APB1LENR_DAC12EN_SHIFT))
#define RCC_APB1LENR_DAC12EN_YES        (1 << (RCC_APB1LENR_DAC12EN_SHIFT))
#define RCC_APB1LENR_I2C3EN_SHIFT       (23)
#define RCC_APB1LENR_I2C3EN_MASK        (1 << (RCC_APB1LENR_I2C3EN_SHIFT))
#define RCC_APB1LENR_I2C3EN_NO          (0 << (RCC_APB1LENR_I2C3EN_SHIFT))
#define RCC_APB1LENR_I2C3EN_YES         (1 << (RCC_APB1LENR_I2C3EN_SHIFT))
#define RCC_APB1LENR_I2C2EN_SHIFT       (22)
#define RCC_APB1LENR_I2C2EN_MASK        (1 << (RCC_APB1LENR_I2C2EN_SHIFT))
#define RCC_APB1LENR_I2C2EN_NO          (0 << (RCC_APB1LENR_I2C2EN_SHIFT))
#define RCC_APB1LENR_I2C2EN_YES         (1 << (RCC_APB1LENR_I2C2EN_SHIFT))
#define RCC_APB1LENR_I2C1EN_SHIFT       (21)
#define RCC_APB1LENR_I2C1EN_MASK        (1 << (RCC_APB1LENR_I2C1EN_SHIFT))
#define RCC_APB1LENR_I2C1EN_NO          (0 << (RCC_APB1LENR_I2C1EN_SHIFT))
#define RCC_APB1LENR_I2C1EN_YES         (1 << (RCC_APB1LENR_I2C1EN_SHIFT))
#define RCC_APB1LENR_USART3EN_SHIFT     (18)
#define RCC_APB1LENR_USART3EN_MASK      (1 << (RCC_APB1LENR_USART3EN_SHIFT))
#define RCC_APB1LENR_USART3EN_NO        (0 << (RCC_APB1LENR_USART3EN_SHIFT))
#define RCC_APB1LENR_USART3EN_YES       (1 << (RCC_APB1LENR_USART3EN_SHIFT))
#define RCC_APB1LENR_USART2EN_SHIFT     (17)
#define RCC_APB1LENR_USART2EN_MASK      (1 << (RCC_APB1LENR_USART2EN_SHIFT))
#define RCC_APB1LENR_USART2EN_NO        (0 << (RCC_APB1LENR_USART2EN_SHIFT))
#define RCC_APB1LENR_USART2EN_YES       (1 << (RCC_APB1LENR_USART2EN_SHIFT))

#define RCC_APB1LENR_LPTIM1EN_SHIFT     (9)
#define RCC_APB1LENR_LPTIM1EN_MASK      (1 << (RCC_APB1LENR_LPTIM1EN_SHIFT))
#define RCC_APB1LENR_LPTIM1EN_NO        (0 << (RCC_APB1LENR_LPTIM1EN_SHIFT))
#define RCC_APB1LENR_LPTIM1EN_YES       (1 << (RCC_APB1LENR_LPTIM1EN_SHIFT))
#define RCC_APB1LENR_TIM14EN_SHIFT      (8)
#define RCC_APB1LENR_TIM14EN_MASK       (1 << (RCC_APB1LENR_TIM14EN_SHIFT))
#define RCC_APB1LENR_TIM14EN_NO         (0 << (RCC_APB1LENR_TIM14EN_SHIFT))
#define RCC_APB1LENR_TIM14EN_YES        (1 << (RCC_APB1LENR_TIM14EN_SHIFT))
#define RCC_APB1LENR_TIM13EN_SHIFT      (7)
#define RCC_APB1LENR_TIM13EN_MASK       (1 << (RCC_APB1LENR_TIM13EN_SHIFT))
#define RCC_APB1LENR_TIM13EN_NO         (0 << (RCC_APB1LENR_TIM13EN_SHIFT))
#define RCC_APB1LENR_TIM13EN_YES        (1 << (RCC_APB1LENR_TIM13EN_SHIFT))
#define RCC_APB1LENR_TIM12EN_SHIFT      (6)
#define RCC_APB1LENR_TIM12EN_MASK       (1 << (RCC_APB1LENR_TIM12EN_SHIFT))
#define RCC_APB1LENR_TIM12EN_NO         (0 << (RCC_APB1LENR_TIM12EN_SHIFT))
#define RCC_APB1LENR_TIM12EN_YES        (1 << (RCC_APB1LENR_TIM12EN_SHIFT))
#define RCC_APB1LENR_TIM7EN_SHIFT       (5)
#define RCC_APB1LENR_TIM7EN_MASK        (1 << (RCC_APB1LENR_TIM7EN_SHIFT))
#define RCC_APB1LENR_TIM7EN_NO          (0 << (RCC_APB1LENR_TIM7EN_SHIFT))
#define RCC_APB1LENR_TIM7EN_YES         (1 << (RCC_APB1LENR_TIM7EN_SHIFT))
#define RCC_APB1LENR_TIM6EN_SHIFT       (4)
#define RCC_APB1LENR_TIM6EN_MASK        (1 << (RCC_APB1LENR_TIM6EN_SHIFT))
#define RCC_APB1LENR_TIM6EN_NO          (0 << (RCC_APB1LENR_TIM6EN_SHIFT))
#define RCC_APB1LENR_TIM6EN_YES         (1 << (RCC_APB1LENR_TIM6EN_SHIFT))
#define RCC_APB1LENR_TIM5EN_SHIFT       (3)
#define RCC_APB1LENR_TIMEN_MASK        (1 << (RCC_APB1LENR_TIM5EN_SHIFT))
#define RCC_APB1LENR_TIM5EN_NO          (0 << (RCC_APB1LENR_TIM5EN_SHIFT))
#define RCC_APB1LENR_TIM5EN_YES         (1 << (RCC_APB1LENR_TIM5EN_SHIFT))
#define RCC_APB1LENR_TIM4EN_SHIFT       (2)
#define RCC_APB1LENR_TIM4EN_MASK        (1 << (RCC_APB1LENR_TIM4EN_SHIFT))
#define RCC_APB1LENR_TIM4EN_NO          (0 << (RCC_APB1LENR_TIM4EN_SHIFT))
#define RCC_APB1LENR_TIM4EN_YES         (1 << (RCC_APB1LENR_TIM4EN_SHIFT))
#define RCC_APB1LENR_TIM3EN_SHIFT       (1)
#define RCC_APB1LENR_TIM3EN_MASK        (1 << (RCC_APB1LENR_TIM3EN_SHIFT))
#define RCC_APB1LENR_TIM3EN_NO          (0 << (RCC_APB1LENR_TIM3EN_SHIFT))
#define RCC_APB1LENR_TIM3EN_YES         (1 << (RCC_APB1LENR_TIM3EN_SHIFT))
#define RCC_APB1LENR_TIM2EN_SHIFT       (0)
#define RCC_APB1LENR_TIM2EN_MASK        (1 << (RCC_APB1LENR_TIM2EN_SHIFT))
#define RCC_APB1LENR_TIM2EN_NO          (0 << (RCC_APB1LENR_TIM2EN_SHIFT))
#define RCC_APB1LENR_TIM2EN_YES         (1 << (RCC_APB1LENR_TIM2EN_SHIFT))

  __IO uint32_t         APB1HENR;       /* 0xec */
#define RCC_APB1HENR_FDCANEN_SHIFT      (8)
#define RCC_APB1HENR_FDCANEN_MASK       (1 << (RCC_APB1HENR_FDCANEN_SHIFT))
#define RCC_APB1HENR_FDCANEN_NO         (0 << (RCC_APB1HENR_FDCANEN_SHIFT))
#define RCC_APB1HENR_FDCANEN_YES        (1 << (RCC_APB1HENR_FDCANEN_SHIFT))
#define RCC_APB1HENR_MDIOSEN_SHIFT      (5)
#define RCC_APB1HENR_MDIOSEN_MASK       (1 << (RCC_APB1HENR_MDIOSEN_SHIFT))
#define RCC_APB1HENR_MDIOSEN_NO         (0 << (RCC_APB1HENR_MDIOSEN_SHIFT))
#define RCC_APB1HENR_MDIOSEN_YES        (1 << (RCC_APB1HENR_MDIOSEN_SHIFT))
#define RCC_APB1HENR_OPAMPEN_SHIFT      (4)
#define RCC_APB1HENR_OPAMPEN_MASK       (1 << (RCC_APB1HENR_OPAMPEN_SHIFT))
#define RCC_APB1HENR_OPAMPEN_NO         (0 << (RCC_APB1HENR_OPAMPEN_SHIFT))
#define RCC_APB1HENR_OPAMPEN_YES        (1 << (RCC_APB1HENR_OPAMPEN_SHIFT))
#define RCC_APB1HENR_SWPEN_SHIFT        (2)
#define RCC_APB1HENR_SWPEN_MASK         (1 << (RCC_APB1HENR_SWPEN_SHIFT))
#define RCC_APB1HENR_SWPEN_NO           (0 << (RCC_APB1HENR_SWPEN_SHIFT))
#define RCC_APB1HENR_SWPEN_YES          (1 << (RCC_APB1HENR_SWPEN_SHIFT))
#define RCC_APB1HENR_CRSEN_SHIFT        (1)
#define RCC_APB1HENR_CRSEN_MASK         (1 << (RCC_APB1HENR_CRSEN_SHIFT))
#define RCC_APB1HENR_CRSEN_NO           (0 << (RCC_APB1HENR_CRSEN_SHIFT))
#define RCC_APB1HENR_CRSEN_YES          (1 << (RCC_APB1HENR_CRSEN_SHIFT))
  __IO uint32_t         APB2ENR;        /* 0xf0 */
#define RCC_APB2ENR_SPI5EN_SHIFT        (20)
#define RCC_APB2ENR_SPI5EN_MASK         (1 << (RCC_APB2ENR_SPI5EN_SHIFT))
#define RCC_APB2ENR_SPI5EN_NO           (0 << (RCC_APB2ENR_SPI5EN_SHIFT))
#define RCC_APB2ENR_SPI5EN_YES          (1 << (RCC_APB2ENR_SPI5EN_SHIFT))
#define RCC_APB2ENR_TIM17EN_SHIFT       (18)
#define RCC_APB2ENR_TIM17EN_MASK        (1 << (RCC_APB2ENR_TIM17EN_SHIFT))
#define RCC_APB2ENR_TIM17EN_NO          (0 << (RCC_APB2ENR_TIM17EN_SHIFT))
#define RCC_APB2ENR_TIM17EN_YES         (1 << (RCC_APB2ENR_TIM17EN_SHIFT))
#define RCC_APB2ENR_TIM16EN_SHIFT       (17)
#define RCC_APB2ENR_TIM16EN_MASK        (1 << (RCC_APB2ENR_TIM16EN_SHIFT))
#define RCC_APB2ENR_TIM16EN_NO          (0 << (RCC_APB2ENR_TIM16EN_SHIFT))
#define RCC_APB2ENR_TIM16EN_YES         (1 << (RCC_APB2ENR_TIM16EN_SHIFT))
#define RCC_APB2ENR_TIM15EN_SHIFT       (16)
#define RCC_APB2ENR_TIM15EN_MASK        (1 << (RCC_APB2ENR_TIM15EN_SHIFT))
#define RCC_APB2ENR_TIM15EN_NO          (0 << (RCC_APB2ENR_TIM15EN_SHIFT))
#define RCC_APB2ENR_TIM15EN_YES         (1 << (RCC_APB2ENR_TIM15EN_SHIFT))
#define RCC_APB2ENR_SPI4EN_SHIFT        (13)
#define RCC_APB2ENR_SPI4EN_MASK         (1 << (RCC_APB2ENR_SPI4EN_SHIFT))
#define RCC_APB2ENR_SPI4EN_NO           (0 << (RCC_APB2ENR_SPI4EN_SHIFT))
#define RCC_APB2ENR_SPI4EN_YES          (1 << (RCC_APB2ENR_SPI4EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_SHIFT        (12)
#define RCC_APB2ENR_SPI1EN_MASK         (1 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_NO           (0 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_YES          (1 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_TIM8EN_SHIFT        (1)
#define RCC_APB2ENR_TIM8EN_MASK         (1 << (RCC_APB2ENR_TIM8EN_SHIFT))
#define RCC_APB2ENR_TIM8EN_NO           (0 << (RCC_APB2ENR_TIM8EN_SHIFT))
#define RCC_APB2ENR_TIM8EN_YES          (1 << (RCC_APB2ENR_TIM8EN_SHIFT))
#define RCC_APB2ENR_TIM1EN_SHIFT        (0)
#define RCC_APB2ENR_TIM1EN_MASK         (1 << (RCC_APB2ENR_TIM1EN_SHIFT))
#define RCC_APB2ENR_TIM1EN_NO           (0 << (RCC_APB2ENR_TIM1EN_SHIFT))
#define RCC_APB2ENR_TIM1EN_YES          (1 << (RCC_APB2ENR_TIM1EN_SHIFT))

  __IO uint32_t         APB4ENR;        /* 0xf4 */
#define RCC_APB4ENR_SAI4EN_SHIFT        (21)
#define RCC_APB4ENR_SAI4EN_MASK         (1 << (RCC_APB4ENR_SAI4EN_SHIFT))
#define RCC_APB4ENR_SAI4EN_NO           (0 << (RCC_APB4ENR_SAI4EN_SHIFT))
#define RCC_APB4ENR_SAI4EN_YES          (1 << (RCC_APB4ENR_SAI4EN_SHIFT))
#define RCC_APB4ENR_RTCAPBEN_SHIFT      (16)
#define RCC_APB4ENR_RTCAPBEN_MASK       (1 << (RCC_APB4ENR_RTCAPBEN_SHIFT))
#define RCC_APB4ENR_RTCAPBEN_NO         (0 << (RCC_APB4ENR_RTCAPBEN_SHIFT))
#define RCC_APB4ENR_RTCAPBEN_YES        (1 << (RCC_APB4ENR_RTCAPBEN_SHIFT))
#define RCC_APB4ENR_VREFEN_SHIFT        (15)
#define RCC_APB4ENR_VREFEN_MASK         (1 << (RCC_APB4ENR_VREFEN_SHIFT))
#define RCC_APB4ENR_VREFEN_NO           (0 << (RCC_APB4ENR_VREFEN_SHIFT))
#define RCC_APB4ENR_VREFEN_YES          (1 << (RCC_APB4ENR_VREFEN_SHIFT))
#define RCC_APB4ENR_COMP12EN_SHIFT      (14)
#define RCC_APB4ENR_COMP12EN_MASK       (1 << (RCC_APB4ENR_COMP12EN_SHIFT))
#define RCC_APB4ENR_COMP12EN_NO         (0 << (RCC_APB4ENR_COMP12EN_SHIFT))
#define RCC_APB4ENR_COMP12EN_YES        (1 << (RCC_APB4ENR_COMP12EN_SHIFT))
#define RCC_APB4ENR_LPRTIM5EN_SHIFT     (12)
#define RCC_APB4ENR_LPRTIM5EN_MASK      (1 << (RCC_APB4ENR_LPRTIM5EN_SHIFT))
#define RCC_APB4ENR_LPRTIM5EN_NO        (0 << (RCC_APB4ENR_LPRTIM5EN_SHIFT))
#define RCC_APB4ENR_LPRTIM5EN_YES       (1 << (RCC_APB4ENR_LPRTIM5EN_SHIFT))
#define RCC_APB4ENR_LPRTIM4EN_SHIFT     (11)
#define RCC_APB4ENR_LPRTIM4EN_MASK      (1 << (RCC_APB4ENR_LPRTIM4EN_SHIFT))
#define RCC_APB4ENR_LPRTIM4EN_NO        (0 << (RCC_APB4ENR_LPRTIM4EN_SHIFT))
#define RCC_APB4ENR_LPRTIM4EN_YES       (1 << (RCC_APB4ENR_LPRTIM4EN_SHIFT))
#define RCC_APB4ENR_LPRTIM3EN_SHIFT     (10)
#define RCC_APB4ENR_LPRTIM3EN_MASK      (1 << (RCC_APB4ENR_LPRTIM3EN_SHIFT))
#define RCC_APB4ENR_LPRTIM3EN_NO        (0 << (RCC_APB4ENR_LPRTIM3EN_SHIFT))
#define RCC_APB4ENR_LPRTIM3EN_YES       (1 << (RCC_APB4ENR_LPRTIM3EN_SHIFT))
#define RCC_APB4ENR_LPRTIM2EN_SHIFT     (9)
#define RCC_APB4ENR_LPRTIM2EN_MASK      (1 << (RCC_APB4ENR_LPRTIM2EN_SHIFT))
#define RCC_APB4ENR_LPRTIM2EN_NO        (0 << (RCC_APB4ENR_LPRTIM2EN_SHIFT))
#define RCC_APB4ENR_LPRTIM2EN_YES       (1 << (RCC_APB4ENR_LPRTIM2EN_SHIFT))
#define RCC_APB4ENR_I2C4EN_SHIFT        (7)
#define RCC_APB4ENR_I2C4EN_MASK         (1 << (RCC_APB4ENR_I2C4EN_SHIFT))
#define RCC_APB4ENR_I2C4EN_NO           (0 << (RCC_APB4ENR_I2C4EN_SHIFT))
#define RCC_APB4ENR_I2C4EN_YES          (1 << (RCC_APB4ENR_I2C4EN_SHIFT))
#define RCC_APB4ENR_SPI6EN_SHIFT        (5)
#define RCC_APB4ENR_SPI6EN_MASK         (1 << (RCC_APB4ENR_SPI6EN_SHIFT))
#define RCC_APB4ENR_SPI6EN_NO           (0 << (RCC_APB4ENR_SPI6EN_SHIFT))
#define RCC_APB4ENR_SPI6EN_YES          (1 << (RCC_APB4ENR_SPI6EN_SHIFT))
#define RCC_APB4ENR_LPUART1EN_SHIFT     (3)
#define RCC_APB4ENR_LPUART1EN_MASK      (1 << (RCC_APB4ENR_LPUART1EN_SHIFT))
#define RCC_APB4ENR_LPUART1EN_NO        (0 << (RCC_APB4ENR_LPUART1EN_SHIFT))
#define RCC_APB4ENR_LPUART1EN_YES       (1 << (RCC_APB4ENR_LPUART1EN_SHIFT))
#define RCC_APB4ENR_SYSCFGEN_SHIFT      (1)
#define RCC_APB4ENR_SYSCFGEN_MASK       (1 << (RCC_APB4ENR_SYSCFGEN_SHIFT))
#define RCC_APB4ENR_SYSCFGEN_NO         (0 << (RCC_APB4ENR_SYSCFGEN_SHIFT))
#define RCC_APB4ENR_SYSCFGEN_YES        (1 << (RCC_APB4ENR_SYSCFGEN_SHIFT))
  uint32_t              resservedf8;

  
} stm32Dev_RCC;
#endif


