zhtlab/KICADKEY/subcpu/Devices/STM32H7/include/stm32h7Rcc.h
#define CALCPLL(no, freqPllIn)      {     \
  m = (float)((RCC_PTR->PLLCKSELR & RCC_PLLCKSELR_DIVM ##no## _MASK)          \
                                    >> RCC_PLLCKSELR_DIVM ##no## _SHIFT); \
  n = (float)(((RCC_PTR->PLL ##no## DIVR & RCC_PLL ##no## DIVR_DIVN ##no## _MASK) \
                          >> RCC_PLL ##no## DIVR_DIVN ##no## _SHIFT) + 1);    \
  frac = 0.0; \
  if(RCC_PTR->PLLCFGR &  RCC_PLLCFGR_PLL ##no## RFRACEN_MASK) { \
    frac  = (float)((RCC_PTR->PLL ##no## FRACR \
                    & RCC_PLL ##no## FRACR_FRACN ##no## _MASK)    \
                    >> RCC_PLL ##no## FRACR_FRACN ##no## _SHIFT); \
    frac /= (float)RCC_PLL ##no## FRACR_FRACN ##no## _VALUE; \
  } \
  vco = (freqPllIn) / m * (n + frac); \
\
  /* div and store P, Q, R */ \
  div   = RCC_PTR->PLL ##no## DIVR & RCC_PLL1DIVR_DIVP1_MASK;   \
  div >>= RCC_PLL ##no## DIVR_DIVP ##no## _SHIFT;           \
  div  += 1;                                            \
  systemClk.pll ##no.P = (uint32_t) ((vco)/(float)div); \
\
  div   = RCC_PTR->PLL ##no## DIVR & RCC_PLL1DIVR_DIVQ1_MASK;   \
  div >>= RCC_PLL ##no## DIVR_DIVQ ##no## _SHIFT;           \
  div  += 1;                                            \
  systemClk.pll ##no.Q = (uint32_t) ((vco)/(float)div); \
\
  div   = RCC_PTR->PLL ##no## DIVR & RCC_PLL1DIVR_DIVR1_MASK;   \
  div >>= RCC_PLL ##no## DIVR_DIVR ##no## _SHIFT;           \
  div  += 1;                                            \
  systemClk.pll ##no.R = (uint32_t) ((vco)/(float)div); \
}
